{"Title": "Boys stag photo scoops Wildlife Photographer of the Year accolade - BBC News", "Link": "https://www.bbc.com/news/uk-england-london-62750748", "Info": "an eight-year-old boy who snapped a stunning shot of a deer in the snow in a london park has scooped a top photography award. joshua cox was just six years old when he captured the majestic animal in richmond park last january with a camera he had received for christmas. \"he almost looked like he was having a snow shower,\" joshua said. it has been highly commended in the wildlife photographer of the year competition. joshua started using a toy camera as a toddler and progressed to a compact camera not long after taking the photo while in lockdown. it had just started to snow when the youngster and his father julian cox, who is also a wildlife photographer, arrived in the park. describing the moment they came across the red deer stag, joshua, from west london, said: \"we were in a blizzard and i saw some snow stags going into the woods and we followed them. \"we got quite close but were a good distance away. luckily we were not disturbing them much.\" his father added: \"joshua has been interested in wildlife from a very young age, from three, and it's really about going on wildlife adventures together and sharing with him what beautiful nature we have here in the british isles. if that inspires him to take photographs that's great. \"joshua only takes photographs when he wants to, when the inspiration takes him and usually when it does he ends up taking better pictures than his dad. \"i'm very proud of josh and very happy for him.\" and the budding photographer's top tips for a great wildlife shot? \"if you spot an animal then just wait for it to look into the camera, make sure it focusses and then press the shutter,\" he said. richmond park is home to herds of red and fallow deer which have been roaming freely since 1637, the natural history museum, which runs the competition, said. the grazing deer help to manage the landscape of the park. the snow stag shot is highly commended in the 10-years-and-under category of the contest, which is in its 58th year and has become one of the most prestigious of its kind. the winning images, including the prestigious grand title award and young grand title award, will be announced on 14 october. © 2022 bbc. the bbc is not responsible for the content of external sites. read about our approach to external linking. "}