{"Title": "Liz Truss A quick guide to the UKs new prime minister - BBC News", "Link": "https://www.bbc.com/news/uk-62750866", "Info": "liz truss is the uk's next prime minister. here's what you need to know about her if you don't regularly follow politics. she's succeeded boris johnson as leader of the conservative party, winning the most votes from members of that party. unless an earlier one is called, the next election isn't due until january 2025. all female prime ministers so far have been conservative. born in oxford, the family moved to paisley in scotland when she was four, then leeds where she went to a state secondary school. she has said her mother took her on marches protesting against nuclear weapons. while she was at oxford university she campaigned for the lib dems, and at the party conference in 1994 she spoke in favour of abolishing the monarchy. she switched to the conservatives while still at university. after university she worked as an accountant for shell, and cable & wireless, and married fellow accountant hugh o'leary in 2000. the family live in thetford, norfolk. she was promoted by david cameron to environment secretary and worked as justice secretary under theresa may. she was eventually made foreign secretary by boris johnson in 2021. when asked whether she models herself on the former tory prime minister, she disagreed with the accusation, saying: \"i don't accept that, i am my own person\". aged nine, she played thatcher in a mock election at school. she apparently got \"zero votes…i didn't even vote for myself\". this includes scrapping the national insurance increase that came into force in april, and suspending green taxes from energy bills to help people cope with increasing costs. but after the result, she changed her mind and declared brexit an opportunity for the uk. she was popular amongst brexit-supporting conservatives in the leadership election. before she entered the leadership contest, many knew her from a speech to the tory party conference in 2014 where she enthusiastically promoted british cheese and pork. © 2022 bbc. the bbc is not responsible for the content of external sites. read about our approach to external linking. "}