{"Title": "Netflix Saudi Arabia and GCC warn streaming giant over violating Islamic values - BBC News", "Link": "https://www.bbc.com/news/world-middle-east-62811522", "Info": "gulf states have demanded that netflix remove all content deemed to violate \"islamic and societal values and principles\", saudi media report. recent material, including that made for children, contravened regulations, saudi and gulf co-operation council media watchdogs warned in a statement. it did not provide any further details. but saudi state tv showed blurred clips from animated show jurassic world: camp cretaceous, in which two teenage girls confess they love each other and kiss. footage from the controversial french film cuties also featured in the report by al ekhbariya tv, along with a caption accusing netflix of being \"cinematic cover for immoral messages that threaten the healthy upbringing of children\". another video on al ekhbariya's website alleged that the streaming service was \"promoting homosexuality by focusing excessively on homosexuals\". the channel also interviewed several public figures with who made similar accusations and called on the authorities to take immediate action. \"[netflix] was contacted to remove this content, including content directed at children, and to ensure adherence to the laws,\" the joint statement from the saudi general commission for audiovisual media and the gcc committee of electronic media officials said. authorities would follow up on compliance with the directives, and \"in the event that the infringing content continues to be broadcast, the necessary legal measures will be taken\", they warned. there was no immediate response to the accusations from netflix. although sunni muslim-ruled saudi arabia has no laws regarding sexual orientation or gender identity, sexual relations outside marriage, including homosexual sex, are strictly prohibited. under the country's interpretation of islamic law, consensual same-sex sexual conduct is punishable by death or flogging, depending on the perceived seriousness of the case. in april, cinemas in saudi arabia did not screen the film doctor strange in the multiverse of madness after disney refused a request from saudi authorities to cut what they called \"lgbtq references\". and the animated film lightyear, which featured a same-sex kiss, was reportedly banned in the kingdom and the united arab emirates in june. youtube was meanwhile accused last month by saudi authorities of permitting \"inappropriate adverts\" that violated islamic values. watch: saudi officials seize rainbow toys they say \"promote homosexuality\" © 2022 bbc. the bbc is not responsible for the content of external sites. read about our approach to external linking. "}