{"Title": "Nice attack Trial for Bastille Day massacre which killed 86 begins - BBC News", "Link": "https://www.bbc.com/news/world-europe-62799419", "Info": "eight suspects have gone on trial in paris for links to a deadly lorry attack in the southern french city of nice in 2016 which killed 86 people. the suspects - who face between five years and life imprisonment - are accused of helping the attacker get weapons, and of logistical support. proceedings will be broadcast live to many of those affected by the attack. this trial is the latest legal process over attacks of terrorism that have rocked the country since 2015. the attacker himself was shot dead after driving a lorry into crowds celebrating bastille day, injuring more than 400. mohamed lahouaiej-bouhlel, ploughed through a crowd of some 30,000 people who had been enjoying a fireworks display on france's national day. careering through the coastal city's seafront boulevard promenade des anglais for more than 2km, the 31-year-old's victims included 15 children. the so-called islamic state group later claimed responsibility for the massacre, but french investigators never found any proof that lahouaiej-bouhlel had links with them. the deadly attack came less than a year after the paris attacks of november 2015 in which 130 people died - the worst peace-time attack the country has ever seen. a special french terrorism court built to deal with that attack is also being used in this latest trial over the attack in nice. but this trial is different, because it lacks any defendants accused of taking part in the attack itself - only defendants accused of aiding the attacker. there are at least 865 civil plaintiffs who will take part, and nearly 250 of those will testify. \"the fact that the sole perpetrator is not there will create frustration. there will be many questions that no one will be able to answer,\" a lawyer for a victims' association taking part in the trial. said. a verdict is expected in december. © 2022 bbc. the bbc is not responsible for the content of external sites. read about our approach to external linking. "}