{"Title": "Sevilla 0-4 Man City Erling Haaland scores twice in comfortable Champions League opening win - BBC Sport", "Link": "https://www.bbc.com/sport/football/62800316", "Info": "erling haaland scored twice as manchester city opened their champions league campaign by thrashing a dismal sevilla side. haaland's ninth goal in five games set city on their way in spain, with the norwegian forward tapping in from kevin de bruyne's superb driven cross. he added to his tally after the break when he was again on hand to score from close range after home goalkeeper yassine bounou parried phil foden's shot into his path. in between, england midfielder foden had given city a healthy cushion in their group g opener, teasing his marker nemanja gudelj before sweeping a left-foot effort into the bottom-right corner of the net. ruben dias underlined the gulf in class between the premier league champions and the side that finished fourth in la liga last term late on, side-footing joao cancelo's cross into the middle of an empty net. \"when they were playing better we scored the second one with a brilliant action from phil [foden]. then after it was easier - we gave more passes,\" city manager pep guardiola told bt sport. \"sometimes we want to rush so quick because erling is there. you have this attraction of him, we want to attack it sometimes. we have to be more patient. i think his numbers across his career, not just here, is quite similar. \"so he has an incredible sense of goal. we have incredible numbers in scoring goals, so we want to continue like that.\" the manner of city's victory and final scoreline was not unduly flattering, with the visitors dominant throughout. julen lopetegui's side looked short of attacking ideas and bereft of confidence after their winless start to the la liga season. with john stones and kyle walker missing because of minor injuries guardiola handed a debut to switzerland defender manuel akanji, but aside from a wild first-half effort from alejandro gomez, the hosts barely threatened. the comprehensive win sends city top of their group, with borussia dortmund second on goal difference after beating fc copenhagen 3-0 in their opener. city's only previous trip to the ramon sanchez-pizjuan stadium came almost seven years ago when wilfried bony scored in comfortable 3-1 win. this performance was even more assured, with guardiola's side monopolising possession against their hosts who offered little threat to counter. predictably haaland, who is seen by many as the man who can be the final piece of the jigsaw as city chase european glory, came to the fore again. the forward maintained his incredible start to his city career as he knocked in goals 11 and 12 from his eight appearances for the club. neither were remarkable, but both owed to his exceptional ability to read the game and anticipate the cross from de bruyne, as well as bounou's mistake. both his finishes were from no more than eight yards out, again underlining his capacity to operate with clinical efficiency from a limited number of touches (19), and they contributed to city's biggest ever win against spanish opposition. "}