{"Title": "US Open Iga Swiatek fights back to set up Jessica Pegula quarter-final - BBC Sport", "Link": "https://www.bbc.com/sport/tennis/62790763", "Info": "top seed iga swiatek avoided a us open upset by recovering to beat unseeded jule niemeier and reach her first quarter-final in new york. swiatek trailed by a set and a break but fought back to win 2-6 6-4 6-1 against the german. the 21-year-old from poland has been the standout wta player this season and is bidding for a seventh title in 2022. the reigning french open champion will play american jessica pegula, who beat czech 21st seed petra kvitova. swiatek took over as the world number one following ashleigh barty's shock retirement in march, fully justifying the position by going on a 37-match winning streak. the dominance led to six titles in a row, winning in doha, indian wells, miami, stuttgart and rome before adding the second triumph of her career at roland garros. unsurprisingly, she has been unable to sustain that sky-high level since but had not dropped a set in new york until 23-year-old niemeier took the lead. swiatek made a lot of errors in the first set and start of the second, enabling wimbledon quarter-finalist niemeier to threaten a major upset and continue her breakthrough season with a notable win. but the german began making mistakes at crucial times - particularly with double faults - and swiatek slowly improved to better last year's run to the fourth round at flushing meadows. \"i'm proud i just didn't lose hope,\" said swiatek. \"she was playing really good in the first set and the second set i tried to focus on the small things that are the base for us. i'm pleased i kept my level.\" later on monday, three-time finalist victoria azarenka, of belarus, plays czech 22nd seed karolina pliskova, while belarusian sixth seed aryna sabalenka faces american 19th seed danielle collins in the night session on ashe (00:00 bst). eighth seed pegula, 28, reached the quarter-finals of her home major for the first time - and the first time she had beaten a seeded player there - with a clinical performance on arthur ashe stadium. two-time wimbledon winner kvitova, 32, led 2-0 in the second set but pegula, leaning on home support, won the next six games to reach a fourth grand slam quarter-final. \"i thought i handled my nerves really well,\" said pegula, who also reached the last eight in melbourne and paris this season. \"i told myself not to get frustrated. she returns really well and it's difficult if you're not getting in first serves. i just really wanted to stay committed to hitting my spots.\" pegula is the daughter of terry pegula, an oil and gas magnate who, according to forbes, is worth $6.7bn (£5.82bn). in 2014 her family bought the buffalo bills who kickstart the nfl season against super bowl champions los angeles rams on thursday (01:20 bst friday). the us open women's semi-finals are due to start at 00:00. \"hopefully it's not at the same time [as a potential semi-final],\" joked pegula, who lost to swiatek in the french open quarter-finals. \"but if i'm still here playing i don't mind missing the game.\" "}